Conf.Simple/src/DataProcessors/SUI_РабочееМестоОператораОбмена/SUI_РабочееМестоОператораОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>SUI_РабочееМестоОператораОбмена</name>
</mdclass:DataProcessor>

Conf.Simple/src/InformationRegisters/SUI_docs/SUI_docs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs</name>
  <resources>
    <name>additional_details</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>doc_date</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>doc_n</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>doc_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_countragents</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>id_warehouse</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>is_barc_flow</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>use_mark</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЭтоДокументАдресногоХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>process_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>cells_process_type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МобильноеУстройство</name>
    <type>
      <types>CatalogRef.Удалить_SUI_МобильныеКлиенты</types>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>id_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Enums/SUI_СостоянияДокументовОбмена/SUI_СостоянияДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_СостоянияДокументовОбмена</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>КВыгрузке</name>
  </enumValues>
  <enumValues>
    <name>Выгружен</name>
  </enumValues>
  <enumValues>
    <name>Загружен</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументов/SUI_НастройкиДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументов</name>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяМаркировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинонимОбъектаМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеДокументаПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>Агрегация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ComputerVision</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументыНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмСозданияНовогоДокумента</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьДокумент1СПослеПолученияИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиЗаполненияРеквизитовПередЗаписью</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиСозданияДокументовНаОснованииПослеЗаписи</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Проводить</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалятьПустыеСтроки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитов</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоответствияРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СопоставлениеРеквизитовТабличныхЧастей</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>80</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользуетсяПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПостоянноеЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиВыводаДополнительныхПолей</name>
    <attributes>
      <name>РеквизитДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяНаУстройстве</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/DataProcessors/SUI_РабочееМестоОператораОбмена/Forms/Основная/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОтборСпискаДокументовОбменаПоНаименованию_ЗагрузитьСписокВыбора();
	
	Если Элементы.ОтборСпискаДокументовОбменаПоНаименованию.СписокВыбора.Количество() > 0 Тогда
		ОтборСпискаДокументовОбменаПоНаименованию = Элементы.ОтборСпискаДокументовОбменаПоНаименованию.СписокВыбора[0].Значение;
	КонецЕсли;

	// СтандартныеПодсистемы.ПодключаемыеКоманды >>>
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Источники = ПодключаемыеКоманды_Источники();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.СписокДокументовОбмена.КоманднаяПанель;
	ПараметрыРазмещения.ПрефиксГрупп = "СписокДокументовОбменаПодключаемыеКоманды_";
	
	Если ПараметрыРазмещения.Источники.Типы().Количество() > 0 Тогда
		
		ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
		
		Для Каждого ПодчиненныйЭлементКПСписка Из Элементы.СписокДокументовОбмена.КоманднаяПанель.ПодчиненныеЭлементы Цикл
			
			Если ПодчиненныйЭлементКПСписка.Вид <> ВидГруппыФормы.Подменю Тогда
				Продолжить;
			КонецЕсли;
			
			Если ПодчиненныйЭлементКПСписка.Имя <> "СписокДокументовОбменаПодключаемыеКоманды_ПодменюПечать" И 
				ПодчиненныйЭлементКПСписка.Имя <> "СписокДокументовОбменаПодключаемыеКоманды_ПодменюОтчеты" И 
				ПодчиненныйЭлементКПСписка.Имя <> "СписокДокументовОбмена_Действия" И
				ПодчиненныйЭлементКПСписка.Имя <> "СписокДокументовОбменаПодключаемыеКоманды_SUI_ПодменюДокументыОбмена" Тогда
				ПодчиненныйЭлементКПСписка.Видимость = Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	// СтандартныеПодсистемы.ПодключаемыеКоманды <<<

	ДатаОтсутствияСеанса = ТекущаяДатаСеанса() - SUI_МобильныеУстройстваСервер.СрокДействительностиСеансаВСекундах();
	SUI_КомпоновкаДанныхКлиентСервер.УстановитьПараметр(СписокМобильныхУстройств.КомпоновщикНастроек, "ДатаОтсутствияСеанса", ДатаОтсутствияСеанса);
	
	Заголовок = РежимОбмена;
	
	// Отобразить QR код для скачивания мобильного приложения
	ДанныеQRКода = SUI_ГенерацияШтрихкода.ДанныеQRКода(
		SUI_SimpleКлиентСервер.АдресAPKМобильногоПриложения(), 0, 130);
	QRСкачатьПриложение = ПоместитьВоВременноеХранилище(ДанныеQRКода, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОтборСпискаДокументовОбмена();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "SUI_ПослеУдаленияДокументовОбмена" Или
		ИмяСобытия = "SUI_ПослеВыгрузкиДокументаОбмена" Или
		ИмяСобытия = "SUI_ПослеЗагрузкиДокументаОбмена" Тогда
		Элементы.СписокДокументовОбмена.Обновить();
		ОтборСпискаДокументовОбменаПоНаименованию_ЗагрузитьСписокВыбора();
		ОтобразитьИнформациюОТекущейСтроке(Элементы.СписокДокументовОбмена.ТекущиеДанные);
	ИначеЕсли ИмяСобытия = "SUI_ПринятЗапросАвторизации" Или
		ИмяСобытия = "SUI_ОтклоненЗапросАвторизации" Тогда
		Элементы.СписокЗапросыАвторизации.Обновить();
		Элементы.СписокМобильныхУстройств.Обновить();
		ОбновитьЗаголовокЗапросыАвторизации();
	ИначеЕсли ИмяСобытия = "SUI_СозданЗапросПолнойВыгрузки" Тогда
		Элементы.СписокМобильныхУстройств.Обновить();
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)

	// Удалить данные qr кода из временного хранилища
	Если ЭтоАдресВременногоХранилища(QRСкачатьПриложение) Тогда
		УдалитьИзВременногоХранилища(QRСкачатьПриложение);
	КонецЕсли;	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ОбновитьЗаголовокЗапросыАвторизации();
КонецПроцедуры

#Область СтраницаДокументы

#Область СтраницаДокументы_СписокДокументовОбмена

&НаКлиенте
Процедура ОтборСпискаДокументовОбменаВсеСостоянияПриИзменении(Элемент)
	УстановитьОтборСпискаДокументовОбмена();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСпискаДокументовОбменаПоНаименованиюПриИзменении(Элемент)
	УстановитьОтборСпискаДокументовОбмена();
КонецПроцедуры

&НаКлиенте
Процедура ОтборСпискаДокументовОбменаПоНаименованиюОчистка(Элемент, СтандартнаяОбработка)

	Если Элементы.ОтборСпискаДокументовОбменаПоНаименованию.СписокВыбора.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		ОтборСпискаДокументовОбменаПоНаименованию = Элементы.ОтборСпискаДокументовОбменаПоНаименованию.СписокВыбора[0].Значение;
		УстановитьОтборСпискаДокументовОбмена();
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовОбменаГиперссылкаДокументаНажатие(Элемент)

	Если Элементы.СписокДокументовОбмена.ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(, Элементы.СписокДокументовОбмена.ТекущиеДанные.Ссылка);
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовОбменаГиперссылкаНастройкаДокументаНажатие(Элемент)
	
	Если Элементы.СписокДокументовОбмена.ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(, Элементы.СписокДокументовОбмена.ТекущиеДанные.НастройкаДокумента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовОбменаГиперссылкаМобильноеУстройствоДокументаНажатие(Элемент)
	
	Если Элементы.СписокДокументовОбмена.ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(, Элементы.СписокДокументовОбмена.ТекущиеДанные.МобильноеУстройство);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовОбменаГиперссылкаТаблицаШтрихкодовДокументНажатие(Элемент)
	
	Если Элементы.СписокДокументовОбмена.ТекущиеДанные <> Неопределено Тогда   
		ОткрытьФорму("Обработка.SUI_ФормаДополнительнаяИнформация.Форма.Форма", Новый Структура("ДокументСсылка", Элементы.СписокДокументовОбмена.ТекущиеДанные.Ссылка));
   	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

&НаКлиенте
Процедура ГиперссылкаДляСкачиванияПриложенияНажатие(Элемент)
	ПерейтиПоНавигационнойСсылке(SUI_SimpleКлиентСервер.АдресAPKМобильногоПриложения());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокДокументовОбмена

&НаКлиенте
Процедура СписокДокументовОбменаПриИзменении(Элемент)
	ОтборСпискаДокументовОбменаПоНаименованию_ЗагрузитьСписокВыбора();
	ОтобразитьИнформациюОТекущейСтроке(Элемент.ТекущиеДанные);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокДокументовОбменаПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Для Каждого СтрокаСписка Из Строки Цикл
		СтрокаСписка.Значение.Данные.Ссылка = SUI_ИнтеграцияВКонфигурацию.СсылкаПоИдентификаторуSimple(
			СтрокаСписка.Ключ.id_doc, Истина);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовОбменаПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды >>>
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// СтандартныеПодсистемы.ПодключаемыеКоманды <<<
	
	ОтобразитьИнформациюОТекущейСтроке(Элемент.ТекущиеДанные);

КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовОбменаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.СписокДокументовОбмена.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.СписокДокументовОбмена.ТекущиеДанные.Состояние = ПредопределенноеЗначение("Перечисление.SUI_СостоянияДокументовОбмена.Загружен") Тогда
		SUI_ДокументыОбменаКлиент.ОткрытьЗагрузкуДокументаИзТСД(
			Элементы.СписокДокументовОбмена.ТекущиеДанные.Ссылка, Новый Структура("Форма", ЭтотОбъект));	
	Иначе
		SUI_ДокументыОбменаКлиент.ОткрытьПросмотрДокументаИзТСД(
			Элементы.СписокДокументовОбмена.ТекущиеДанные.Ссылка, Новый Структура("Форма", ЭтотОбъект));		       
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды >>>
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.СписокДокументовОбмена);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.СписокДокументовОбмена, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.СписокДокументовОбмена);
КонецПроцедуры
// СтандартныеПодсистемы.ПодключаемыеКоманды <<<

&НаКлиенте
Процедура СообщитьОПроблеме(Команда)
	ОткрытьФорму("Обработка.SUI_ОбращениеВТехническуюПоддержку.Форма", , ЭтотОбъект, УникальныйИдентификатор);
КонецПроцедуры

#Область СтраницаДокументы

#Область СтраницаДокументы_СписокДокументовОбмена

&НаКлиенте
Процедура СписокДокументовОбмена_Удалить(Команда)

	Если Элементы.СписокДокументовОбмена.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	SUI_ДокументыОбменаКлиент.УдалитьРанееВыгруженныеДанные(
		SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.МассивЗначений(
			Элементы.СписокДокументовОбмена.ТекущиеДанные.Ссылка), 
		Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовОбмена_Выгрузить(Команда)
	
	Если Элементы.СписокДокументовОбмена.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	SUI_ДокументыОбменаКлиент.ОткрытьВыгрузкуДокументаНаТСД(
		Элементы.СписокДокументовОбмена.ТекущиеДанные.Ссылка, Новый Структура("Форма", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовОбмена_Загрузить(Команда)
	
	Если Элементы.СписокДокументовОбмена.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	SUI_ДокументыОбменаКлиент.ОткрытьЗагрузкуДокументаИзТСД(
		Элементы.СписокДокументовОбмена.ТекущиеДанные.Ссылка, Новый Структура("Форма", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДокументДляВыгрузки(Команда)
	
	ПараметрыВыбораДокумента = Новый Структура();
//	ПараметрыВыбораДокумента.Вставить("НастройкаДокумента", Неопределено);

	ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыбратьДокументДляВыгрузкиЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Обработка.SUI_РабочееМестоОператораОбмена.Форма.ВыборДокументаДляВыгрузки", ПараметрыВыбораДокумента, 
		ЭтотОбъект, УникальныйИдентификатор, , , ОповещениеОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПользователейИВыгрузить(Команда)
	ОткрытьФорму("Обработка.SUI_РабочееМестоОператораОбмена.Форма.ОбменСПользователямиОфлайн");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СтраницаМобильныеУстройства

#Область СтраницаМобильныеУстройства_СписокЗапросыАвторизации

&НаКлиенте
Процедура СписокЗапросыАвторизации_Принять(Команда)
	
	Если Элементы.СписокЗапросыАвторизации.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	SUI_МобильныеУстройстваКлиент.ПринятьЗапросАвторизации(
		Элементы.СписокЗапросыАвторизации.ТекущиеДанные.ИдентификаторУстройства);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗапросыАвторизации_Отклонить(Команда)
	
	Если Элементы.СписокЗапросыАвторизации.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	SUI_МобильныеУстройстваКлиент.ОтклонитьЗапросАвторизации(
		Элементы.СписокЗапросыАвторизации.ТекущиеДанные.ИдентификаторУстройства);
		
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СформироватьQRКодПодключенияМобильногоКлиента(Команда)

	ОткрытьФорму("ОбщаяФорма.SUI_QRКодДляПодключенияМобильногоПриложения", , 
		ЭтотОбъект, УникальныйИдентификатор);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПодключаемыеКоманды_Источники()
	
	Источники = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	SUI_НастройкиДокументов.ИмяОбъектаМетаданных КАК ИмяОбъектаМетаданных
	|ИЗ
	|	Справочник.SUI_НастройкиДокументов КАК SUI_НастройкиДокументов";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Источники.Добавить(Тип("ДокументСсылка." + Выборка.ИмяОбъектаМетаданных));	
	КонецЦикла;
	
	Возврат Новый ОписаниеТипов(Источники);
	
КонецФункции

&НаСервере
Процедура ОтборСпискаДокументовОбменаПоНаименованию_ЗагрузитьСписокВыбора()

	Элементы.ОтборСпискаДокументовОбменаПоНаименованию.СписокВыбора.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	""Все"" КАК Наименование,
	|	КОЛИЧЕСТВО(SUI_docs_beta.sid) КАК Количество
	|ИЗ
	|	РегистрСведений.SUI_docs КАК SUI_docs_beta
	|СГРУППИРОВАТЬ ПО
	|	ЗНАЧЕНИЕ(Справочник.SUI_НастройкиДокументов.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	SUI_docs_beta.doc_type,
	|	КОЛИЧЕСТВО(SUI_docs_beta.doc_type)
	|ИЗ
	|	РегистрСведений.SUI_docs КАК SUI_docs_beta
	|СГРУППИРОВАТЬ ПО
	|	SUI_docs_beta.doc_type
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	SUI_НастройкиДокументов.Наименование,
	|	0
	|ИЗ
	|	Справочник.SUI_НастройкиДокументов КАК SUI_НастройкиДокументов
	|ГДЕ
	|	НЕ SUI_НастройкиДокументов.Ссылка В
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			SUI_docs.НастройкаДокумента
	|		ИЗ
	|			РегистрСведений.SUI_docs КАК SUI_docs)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Количество УБЫВ";
	 
	РезультатЗапроса = Запрос.Выполнить();
	 
	Выборка = РезультатЗапроса.Выбрать();
	 
	Пока Выборка.Следующий() Цикл
		Элементы.ОтборСпискаДокументовОбменаПоНаименованию.СписокВыбора.Добавить(Выборка.Наименование, 
			Выборка.Наименование + " (" + Строка(Выборка.Количество) + ")");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборСпискаДокументовОбмена()
	
	Если ОтборСпискаДокументовОбменаВсеСостояния Тогда
		SUI_КомпоновкаДанныхКлиентСервер.УдалитьОтбор(СписокДокументовОбмена.Отбор, "Состояние");
	Иначе
		
		СостоянияКОтображению = Новый СписокЗначений();
		
		СостоянияКОтображению.Добавить(ПредопределенноеЗначение("Перечисление.SUI_СостоянияДокументовОбмена.Новый"));
		СостоянияКОтображению.Добавить(ПредопределенноеЗначение("Перечисление.SUI_СостоянияДокументовОбмена.КВыгрузке"));
		СостоянияКОтображению.Добавить(ПредопределенноеЗначение("Перечисление.SUI_СостоянияДокументовОбмена.Выгружен"));
		СостоянияКОтображению.Добавить(ПредопределенноеЗначение("Перечисление.SUI_СостоянияДокументовОбмена.Загружен"));
		СостоянияКОтображению.Добавить(ПредопределенноеЗначение("Перечисление.SUI_СостоянияДокументовОбмена.ВРаботе"));
		
		SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(СписокДокументовОбмена.Отбор, "Состояние", 
			СостоянияКОтображению, ВидСравненияКомпоновкиДанных.ВСписке);
	
	КонецЕсли;
	
	Если ОтборСпискаДокументовОбменаПоНаименованию = "Все" Тогда 		 
		SUI_КомпоновкаДанныхКлиентСервер.УдалитьОтбор(СписокДокументовОбмена.Отбор, "Наименование");
	Иначе 
		SUI_КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(СписокДокументовОбмена.Отбор, "Наименование", ОтборСпискаДокументовОбменаПоНаименованию);
	КонецЕсли
	
КонецПроцедуры

//@skip-check bsl-nstr-string-literal-format
&НаКлиенте
Процедура ОтобразитьИнформациюОТекущейСтроке(ДанныеСтроки)
	
	Если ДанныеСтроки <> Неопределено Тогда
		
		Элементы.ГруппаСписокДокументовОбменаИнформацияТекущейСтроки.Видимость = Истина;
		
		Если ДанныеСтроки.Свойство("Наименование") И ДанныеСтроки.Свойство("Ссылка") И
			ЗначениеЗаполнено(ДанныеСтроки.Наименование) И ЗначениеЗаполнено(ДанныеСтроки.Ссылка) Тогда
			Элементы.СписокДокументовОбменаГиперссылкаДокумента.Заголовок = СтрШаблон(НСтр("ru = '%1 (%2)'"),
				ДанныеСтроки.Наименование, ДанныеСтроки.Ссылка);
		Иначе
			Элементы.СписокДокументовОбменаГиперссылкаДокумента.Заголовок = "";
		КонецЕсли;
		
		Если ДанныеСтроки.Свойство("НастройкаДокумента") И ЗначениеЗаполнено(ДанныеСтроки.НастройкаДокумента) Тогда
			Элементы.СписокДокументовОбменаГиперссылкаНастройкаДокумента.Заголовок = СтрШаблон(
				НСтр("ru = 'Настройка документа: %1'"), ДанныеСтроки.НастройкаДокумента);
		Иначе
			Элементы.СписокДокументовОбменаГиперссылкаНастройкаДокумента.Заголовок = "";
		КонецЕсли;
		
		Если ДанныеСтроки.Свойство("МобильноеУстройство") И ЗначениеЗаполнено(ДанныеСтроки.МобильноеУстройство) Тогда	
			Элементы.СписокДокументовОбменаГиперссылкаМобильноеУстройствоДокумента.Заголовок = СтрШаблон(
				НСтр("ru = 'Мобильное устройство документа: %1'"), ДанныеСтроки.МобильноеУстройство);
		Иначе
			Элементы.СписокДокументовОбменаГиперссылкаМобильноеУстройствоДокумента.Заголовок = "";
		КонецЕсли;
		
		//@skip-check new-font
		ШрифтЗначения = Новый Шрифт(, , , Истина);
		ЦветЗначения = WebЦвета.СинийСоСтальнымОттенком;
		
		МассивФС = Новый Массив();
		
		МассивФС.Добавить(НСтр("ru = 'Номер и дата документа: '"));
		МассивФС.Добавить(Новый ФорматированнаяСтрока(ДанныеСтроки.Номер + " от " + ДанныеСтроки.Дата, ШрифтЗначения, ЦветЗначения));
		МассивФС.Добавить(Символы.ПС + Символы.ПС);
		
		МассивФС.Добавить(НСтр("ru = 'Текущее состояние: '"));
		МассивФС.Добавить(Новый ФорматированнаяСтрока(Строка(ДанныеСтроки.Состояние), ШрифтЗначения, ЦветЗначения));
		МассивФС.Добавить(Символы.ПС + Символы.ПС);
		
		МассивФС.Добавить(НСтр("ru = 'Документ адресного хранения: '"));
		МассивФС.Добавить(Новый ФорматированнаяСтрока(Строка(ДанныеСтроки.ЭтоДокументАдресногоХранения), ШрифтЗначения, ЦветЗначения));
		МассивФС.Добавить(Символы.ПС + Символы.ПС);
		
		МассивФС.Добавить(НСтр("ru = 'Товары: '"));
		МассивФС.Добавить(Новый ФорматированнаяСтрока(СтрШаблон(НСтр("ru = ' %1 строк (-и)'"), 
			ДанныеСтроки.КоличествоСтрокТовары), ШрифтЗначения, ЦветЗначения));
		МассивФС.Добавить(Символы.ПС);
		
		МассивФС.Добавить(НСтр("ru = 'Штрихкоды упаковок: '"));
		МассивФС.Добавить(Новый ФорматированнаяСтрока(СтрШаблон(НСтр("ru = ' %1 строк (-и)'"), 
			ДанныеСтроки.КоличествоСтрокШтрихкодыУпаковок), ШрифтЗначения, ЦветЗначения));
		МассивФС.Добавить(Символы.ПС);
			
		МассивФС.Добавить(НСтр("ru = 'Серии: '"));
		МассивФС.Добавить(Новый ФорматированнаяСтрока(СтрШаблон(НСтр("ru = ' %1 строк (-и)'"), 
			ДанныеСтроки.КоличествоСтрокСерии), ШрифтЗначения, ЦветЗначения));
		МассивФС.Добавить(Символы.ПС + Символы.ПС);
					
		МассивФС.Добавить(НСтр("ru = 'Сумма план / факт: '"));
		Если ДанныеСтроки.СуммаПлан <> ДанныеСтроки.СуммаФакт Или 
			(ДанныеСтроки.СуммаПлан = 0 И ДанныеСтроки.СуммаФакт = 0) Тогда
			МассивФС.Добавить(Новый ФорматированнаяСтрока(Строка(ДанныеСтроки.СуммаПлан) + " / " + Строка(ДанныеСтроки.СуммаФакт), 
				ШрифтЗначения, WebЦвета.Киноварь));
		Иначе
			МассивФС.Добавить(Новый ФорматированнаяСтрока(Строка(ДанныеСтроки.СуммаПлан) + " / " + Строка(ДанныеСтроки.СуммаФакт), 
				ШрифтЗначения, ЦветЗначения));
		КонецЕсли;
		МассивФС.Добавить(Символы.ПС + Символы.ПС);
		
		МассивФС.Добавить(НСтр("ru = 'Дата обновления: '"));
		МассивФС.Добавить(Новый ФорматированнаяСтрока(Строка(ДанныеСтроки.ДатаОбновления), ШрифтЗначения, ЦветЗначения));
	
		Элементы.СписокДокументовОбменаИнформацияТекущейСтроки.Заголовок = Новый ФорматированнаяСтрока(МассивФС);
		
	Иначе
		Элементы.ГруппаСписокДокументовОбменаИнформацияТекущейСтроки.Видимость = Ложь;
		Элементы.СписокДокументовОбменаГиперссылкаДокумента.Заголовок = "";
		Элементы.СписокДокументовОбменаГиперссылкаНастройкаДокумента.Заголовок = "";
		Элементы.СписокДокументовОбменаГиперссылкаМобильноеУстройствоДокумента.Заголовок = "";
		Элементы.СписокДокументовОбменаИнформацияТекущейСтроки.Заголовок = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовокЗапросыАвторизации()
	ОбновитьЗаголовокЗапросыАвторизацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьЗаголовокЗапросыАвторизацииНаСервере()
	
	Если Не ПолучитьФункциональнуюОпцию("SUI_ИспользоватьЗапросыАвторизацииМУ") Тогда
		Возврат;
	КонецЕсли;
	
	Схема = Элементы.СписокЗапросыАвторизации.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.СписокЗапросыАвторизации.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = МакетКомпоновки.НаборыДанных.НаборДанныхДинамическогоСписка.Запрос;
	
	ПозВыбратьНачало = СтрНайти(Запрос.Текст, "ВЫБРАТЬ ", НаправлениеПоиска.СКонца);
	Пока НЕ ПозВыбратьНачало = 1
		и НЕ Сред(Запрос.Текст, ПозВыбратьНачало - 1, 1) = Символы.ПС Цикл
		ПозВыбратьНачало = СтрНайти(Запрос.Текст, "ВЫБРАТЬ ", НаправлениеПоиска.СКонца, ПозВыбратьНачало - 1);
	КонецЦикла;
	ПозВыбратьКонец = СтрНайти(Запрос.Текст, Символы.ПС,, ПозВыбратьНачало);
	
	СтрокаВЫБРАТЬ = Лев(Запрос.Текст, ПозВыбратьКонец);
	СтрокаИз = Сред(Запрос.Текст, СтрНайти(Запрос.Текст, Символы.ПС + "ИЗ" + Символы.ПС,, ПозВыбратьКонец));
	
	Если СтрНайти(СтрокаИз, Символы.ПС + "СГРУППИРОВАТЬ") Тогда
		СтрокаИз = Лев(СтрокаИз, СтрНайти(СтрокаИз, Символы.ПС + "СГРУППИРОВАТЬ"));
	КонецЕсли;
	
	Запрос.Текст = СтрокаВЫБРАТЬ + "Количество(*) КАК Количество" + СтрокаИз;
	Если СтрНайти(Запрос.Текст, Символы.ПС + "УПОРЯДОЧИТЬ ПО",, ПозВыбратьКонец) Тогда
		Запрос.Текст = Лев(Запрос.Текст, СтрНайти(Запрос.Текст, Символы.ПС + "УПОРЯДОЧИТЬ ПО",, ПозВыбратьКонец));
	КонецЕсли;
	
	Для Каждого парам из МакетКомпоновки.ЗначенияПараметров Цикл
		Запрос.УстановитьПараметр(парам.Имя, парам.Значение);
	КонецЦикла;
	
	Попытка
		Результат = Запрос.Выполнить();
	Исключение
		SUI_ЖурналРегистрации.ЗаписьВЖурналРегистрации(, , Метаданные.ОбщиеМодули.SUI_ОбщегоНазначенияВызовСервера,
			 , ИнформацияОбОшибке());
	КонецПопытки;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Если Выборка.Количество > 0 Тогда
		Элементы.ГруппаСписокЗапросыАвторизации.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Запросы авторизации (%1)'"), Выборка.Количество);
		Элементы.ГруппаСписокЗапросыАвторизации.ЦветТекстаЗаголовка = WebЦвета.ЦветМорскойВолны;
	Иначе
		Элементы.ГруппаСписокЗапросыАвторизации.Заголовок = НСтр("ru = 'Запросы авторизации'");
		Элементы.ГруппаСписокЗапросыАвторизации.ЦветТекстаЗаголовка = WebЦвета.ГрифельноСерый;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДокументДляВыгрузкиЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.SUI_ВыгрузкаДокументаНаТСД", ВыбранноеЗначение, ЭтотОбъект, УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти
